app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2014-01-18 13:58:32', 'bunlong.van@gmail.com', '$2a$10$JgtY1rWq3HqzgmPe1WpPvOtIakstQ4qqN5vLXp6whWBA8BWAUyZbK', '$2a$10$JgtY1rWq3HqzgmPe1WpPvO', '2014-01-18 13:58:32')
---
  def create
    @user = User.new(user_params)
    if @user.save